λ„¤νΈμ›ν¬ κµ¬μ¶• κ³Όμ •μ—μ„ μ–΄λ ¤μ›€μ„ κ²λ” κ²½μ°λ¥Ό λ€λΉ„ν•μ—¬, **Packet Tracer CLIμ— κ·Έλ€λ΅ λ³µμ‚¬ν•μ—¬ λ¶™μ—¬λ„£κΈ°(Paste)** ν•  μ μλ” μµμΆ… μ„¤μ • μ¤ν¬λ¦½νΈλ¥Ό λ‹¨κ³„λ³„λ΅ κµ¬μ„±ν•μ€μµλ‹λ‹¤. κ° μ¥λΉ„μ ν”„λ΅¬ν”„νΈ μƒνƒ(`config`, `config-if` λ“±)λ¥Ό λ…μ‹ν•μ€μΌλ©°, ν•„μ λ…λ Ήμ–΄μΈ `no shutdown`κ³Ό μ£Όμ„μ„ ν¬ν•¨ν–μµλ‹λ‹¤.

---

## [STEP 1] Router0 μ„¤μ • (ISP 1 λ° NAT)

Router0μ€ μ™Έλ¶€ ISP 1λΌμΈ(111.111.111.2)μ„ μ²λ¦¬ν•λ©°, λ‚΄λ¶€λ§μ μΈν„°λ„· ν†µμ‹ μ„ μ§€μ›ν•©λ‹λ‹¤.

```bash
Router> enable
Router# configure terminal
Router0(config)# hostname Router0

! --- μ™Έλ¶€ μΈν„°νμ΄μ¤ μ„¤μ • ---
Router0(config)# interface GigabitEthernet0/0
Router0(config-if)# ip address 111.111.111.2 255.255.255.252
Router0(config-if)# ip nat outside             ! μ™Έλ¶€ μΈν„°νμ΄μ¤ μ„ μ–Έ
Router0(config-if)# no shutdown                ! ν¬νΈ ν™μ„±ν™”
Router0(config-if)# exit

! --- λ‚΄λ¶€ λ°±λ³Έ μ—°κ²° μΈν„°νμ΄μ¤ ---
Router0(config)# interface GigabitEthernet0/1
Router0(config-if)# ip address 172.16.1.1 255.255.255.0
Router0(config-if)# ip nat inside              ! λ‚΄λ¶€ μΈν„°νμ΄μ¤ μ„ μ–Έ
Router0(config-if)# no shutdown
Router0(config-if)# exit

Router0(config)# interface GigabitEthernet0/2
Router0(config-if)# ip address 172.16.4.1 255.255.255.0
Router0(config-if)# ip nat inside
Router0(config-if)# no shutdown
Router0(config-if)# exit

! --- λΌμ°ν… λ° NAT κ·μΉ™ μ„¤μ • ---
Router0(config)# ip route 0.0.0.0 0.0.0.0 111.111.111.1
Router0(config)# access-list 1 permit 192.168.0.0 0.0.255.255
Router0(config)# ip nat inside source list 1 interface GigabitEthernet0/0 overload

! --- OSPF λ™μ  λΌμ°ν… ---
Router0(config)# router ospf 1
Router0(config-router)# network 172.16.1.0 0.0.0.255 area 0
Router0(config-router)# network 172.16.4.0 0.0.0.255 area 0
Router0(config-router)# default-information originate ! μΈν„°λ„· κ²½λ΅ μ „ν
Router0(config-router)# end
Router0# write memory

```

---

## [STEP 2] Router1 μ„¤μ • (ISP 2 λ° λ΅λ“λ°Έλ°μ‹±)

Router1μ€ ISP 2λΌμΈ(222.222.222.2)μ„ ν†µν•΄ νΈλν”½μ„ λ¶„μ‚° μ²λ¦¬ν•©λ‹λ‹¤.

```bash
Router> enable
Router# configure terminal
Router1(config)# hostname Router1

Router1(config)# interface GigabitEthernet0/0
Router1(config-if)# ip address 222.222.222.2 255.255.255.252
Router1(config-if)# ip nat outside
Router1(config-if)# no shutdown
Router1(config-if)# exit

Router1(config)# interface GigabitEthernet0/1
Router1(config-if)# ip address 172.16.3.1 255.255.255.0
Router1(config-if)# ip nat inside
Router1(config-if)# no shutdown
Router1(config-if)# exit

Router1(config)# interface GigabitEthernet0/2
Router1(config-if)# ip address 172.16.2.1 255.255.255.0
Router1(config-if)# ip nat inside
Router1(config-if)# no shutdown
Router1(config-if)# exit

Router1(config)# ip route 0.0.0.0 0.0.0.0 222.222.222.1
Router1(config)# access-list 1 permit 192.168.0.0 0.0.255.255
Router1(config)# ip nat inside source list 1 interface GigabitEthernet0/0 overload

Router1(config)# router ospf 1
Router1(config-router)# network 172.16.2.0 0.0.0.255 area 0
Router1(config-router)# network 172.16.3.0 0.0.0.255 area 0
Router1(config-router)# default-information originate
Router1(config-router)# end
Router1# write memory

```

---

## [STEP 3] SW0 μ„¤μ • (VLAN 10-120 Active / Priority 110)

SW0μ€ λ¨λ“  VLANμ λ©”μΈ κ²μ΄νΈμ›¨μ΄ μ—­ν• μ„ μν–‰ν•λ„λ΅ **Priority 110**μ„ μ μ©ν•©λ‹λ‹¤.

```bash
Switch> enable
Switch# configure terminal
SW0(config)# hostname SW0
SW0(config)# ip routing                      ! L3 λΌμ°ν… ν™μ„±ν™” ν•„μ

! --- λΌμ°ν„° μ—°κ²° (L3 ν¬νΈ μ „ν™) ---
SW0(config)# interface GigabitEthernet0/1
SW0(config-if)# no switchport                ! L2 κΈ°λ¥μ„ λ„κ³  IP λ¶€μ—¬
SW0(config-if)# ip address 172.16.1.2 255.255.255.0
SW0(config-if)# no shutdown
SW0(config-if)# exit

SW0(config)# interface GigabitEthernet0/2
SW0(config-if)# no switchport
SW0(config-if)# ip address 172.16.3.2 255.255.255.0
SW0(config-if)# no shutdown
SW0(config-if)# exit

! --- λ‹¤μ¤‘ VLAN(10~120) HSRP Active μ„¤μ • ---
! * VLAN 10 μμ‹ (λ‚λ¨Έμ§€ VLAN 20~120λ„ λ™μΌν• ν¨ν„΄μΌλ΅ λ°λ³µ)
SW0(config)# vlan 10
SW0(config-vlan)# exit
SW0(config)# interface Vlan 10
SW0(config-if)# ip address 192.168.10.2 255.255.255.0
SW0(config-if)# standby 10 ip 192.168.10.1   ! κ°€μƒ κ²μ΄νΈμ›¨μ΄ IP
SW0(config-if)# standby 10 priority 110      ! Active κ¶ν• λ¶€μ—¬
SW0(config-if)# standby 10 preempt           ! μ°μ„ μμ„ λ†’μ€ μ¥λΉ„κ°€ Active μ„ μ 
SW0(config-if)# no shutdown
SW0(config-if)# exit

! --- OSPF μ„¤μ • ---
SW0(config)# router ospf 1
SW0(config-router)# network 172.16.1.0 0.0.0.255 area 0
SW0(config-router)# network 172.16.3.0 0.0.0.255 area 0
SW0(config-router)# network 192.168.0.0 0.0.255.255 area 0
SW0(config-router)# end
SW0# write memory

```

---

## [STEP 4] SW1 μ„¤μ • (VLAN 10-120 Standby)

SW1μ€ μ¥μ•  λ€λΉ„μ©μΌλ΅ κΈ°λ³Έ μ°μ„ μμ„(100)λ¥Ό μ μ§€ν•©λ‹λ‹¤.

```bash
Switch> enable
Switch# configure terminal
SW1(config)# hostname SW1
SW1(config)# ip routing

SW1(config)# interface GigabitEthernet0/1
SW1(config-if)# no switchport
SW1(config-if)# ip address 172.16.4.2 255.255.255.0
SW1(config-if)# no shutdown
SW1(config-if)# exit

SW1(config)# interface GigabitEthernet0/2
SW1(config-if)# no switchport
SW1(config-if)# ip address 172.16.2.2 255.255.255.0
SW1(config-if)# no shutdown
SW1(config-if)# exit

! --- λ‹¤μ¤‘ VLAN(10~120) HSRP Standby μ„¤μ • ---
SW1(config)# vlan 10
SW1(config-vlan)# exit
SW1(config)# interface Vlan 10
SW1(config-if)# ip address 192.168.10.3 255.255.255.0
SW1(config-if)# standby 10 ip 192.168.10.1
SW1(config-if)# standby 10 priority 100      ! κΈ°λ³Έκ°’ μ μ§€
SW1(config-if)# standby 10 preempt
SW1(config-if)# no shutdown
SW1(config-if)# exit

! --- OSPF μ„¤μ • ---
SW1(config)# router ospf 1
SW1(config-router)# network 172.16.2.0 0.0.0.255 area 0
SW1(config-router)# network 172.16.4.0 0.0.0.255 area 0
SW1(config-router)# network 192.168.0.0 0.0.255.255 area 0
SW1(config-router)# end
SW1# write memory

```

---

## π’΅ μ£Όμμ‚¬ν•­ λ° ν™•μΈ λ°©λ²•

* **λ³µμ‚¬ λ°©λ²•**: `!`λ΅ μ‹μ‘ν•λ” μ£Όμ„μ„ μ μ™Έν•κ³  λ…λ Ήμ–΄λ¥Ό μμ„λ€λ΅ λ³µμ‚¬ν•μ—¬ CLI μ°½μ—μ„ λ§μ°μ¤ μ°ν΄λ¦­ -> **Paste**λ¥Ό λ„λ¥΄μ„Έμ”.
* **ν†µμ‹  ν™•μΈ**: PCμ—μ„ `ping 8.8.8.8` λλ” `ping 111.111.111.1`μ„ ν†µν•΄ μΈν„°λ„· μ—°κ²°μ„ ν™•μΈν•©λ‹λ‹¤.
* **μƒνƒ ν™•μΈ**: μ¤μ„μΉμ—μ„ `show standby brief`λ¥Ό μ…λ ¥ν•μ—¬ HSRP μƒνƒ(Active/Standby)κ°€ μ •μƒμΈμ§€ μ²΄ν¬ν•©λ‹λ‹¤.
* **AWS κ³ΌκΈ μ£Όμ**: μ‹¤μ  ν™κ²½μ—μ„ AWS VPNμ„ κµ¬μ„±ν•  κ²½μ° ν„°λ„λ‹Ή μ‹κ°„ λΉ„μ©(μ•½ $0.05/hr)μ΄ λ°μƒν•λ―€λ΅ μ‹¤μµ ν›„ λ°λ“μ‹ μμ›μ„ μ‚­μ ν•΄μ•Ό ν•©λ‹λ‹¤.

Next Level : AWS Transit Gatewayμ™€ BGPλ¥Ό μ΄μ©ν• λ‹¤μ¤‘ VLAN λΌμ°ν… ν†µν•© λ¶„μ‚°

λ³µμ‚¬ λ¶™μ—¬λ„£κΈ° μ¤ν¬λ¦½νΈ, no shutdown ν¬ν•¨, HSRP Priority 110, OSPF ECMP ν™μ„±ν™”
