## AWS 하이브리드 클라우드 연동을 위한 최종 표준 네트워크 설계


<img width="1536" height="791" alt="image" src="https://github.com/user-attachments/assets/b9b96f0b-2c02-462a-b2bc-47941a2e3c66" />




업로드하신 이미지(`image_5f2424.png`)는 각 장비 간의 연결 구간을 독립된 서브넷으로 완벽히 분리하면서도, 3단계 계층 구조(Core-Distribution-Access)에 맞는 일관된 IP 규칙을 적용한 최적의 설계입니다. 이 구성은 향후 AWS Site-to-Site VPN을 통해 온프레미스와 클라우드를 연결할 때 라우팅 경로를 가장 명확하게 제어할 수 있는 구조입니다.



## 1. 네트워크 주소 할당표 (최종본 반영)

내부 사용자 망은 대중적인 사설 대역인 `192.168.10.x`를 사용하고, 장비 간 연결 구간은 AWS VPC(일반적으로 `10.x.x.x` 사용)와 중복되지 않도록 `172.16.x.x` 대역을 엄격히 분리하여 할당했습니다.

| 구분 | 장비 및 인터페이스 | IP 주소 / Subnet | 연결 대상 및 목적 |
| --- | --- | --- | --- |
| **외부 연동** | Router0 Gi0/0 | **111.111.111.2/30** | ISP 1 (Primary Public Link) |
|  | Router1 Gi0/0 | **222.222.222.2/30** | ISP 2 (Secondary Public Link) |
| **백본 연결** | Router0 ↔ SW0 | 172.16.1.1 ↔ 1.2 /24 | 내부 라우팅 경로 A |
|  | Router0 ↔ SW1 | 172.16.4.1 ↔ 4.2 /24 | 내부 라우팅 경로 B |
|  | Router1 ↔ SW0 | 172.16.3.1 ↔ 3.2 /24 | 내부 라우팅 경로 C |
|  | Router1 ↔ SW1 | 172.16.2.1 ↔ 2.2 /24 | 내부 라우팅 경로 D |
| **사용자 망** | **Vlan 10 가상 GW** | **192.168.10.1/24** | **HSRP 가상 게이트웨이 IP** |
|  | SW0 Vlan 10 | 192.168.10.2/24 | SW0용 인터페이스 IP |
|  | SW1 Vlan 10 | 192.168.10.2/24 | SW1용 인터페이스 IP (이미지 기준 동일 할당) |

---

네트워크 엔지니어링 실무 및 강의 교재로 활용할 수 있도록, **L3 스위치 이중화(HSRP Priority 110)** 및 **ISP 로드밸런싱**이 적용된 전체 구성 프로세스를 정리했습니다. 각 장비의 CLI 프롬프트 변화와 필수 명령어(`no shutdown` 등)를 포함하여 한 번에 복사해서 사용할 수 있는 포맷으로 작성하였습니다.

---

네트워크 가용성과 확장성을 극대화하기 위해 VLAN 10부터 120까지(10단위) 총 12개의 가상 LAN을 구성하고, 각 VLAN에 대해 **HSRP(Hot Standby Router Protocol)** 이중화와 **OSPF** 로드밸런싱을 적용한 전체 구축 공정입니다.

---

## [STEP 1] Router0 설정 (ISP 1 서비스 및 외부 게이트웨이)

Router0은 첫 번째 공인 IP를 관리하며, 내부 모든 VLAN 대역이 인터넷이 가능하도록 NAT 처리를 수행합니다.

```bash
Router> enable
Router# configure terminal
Router0(config)# hostname Router0

! --- 외부 ISP 1 인터페이스 활성화 ---
Router0(config)# interface GigabitEthernet0/0
Router0(config-if)# description Link_to_ISP1
Router0(config-if)# ip address 111.111.111.2 255.255.255.252
Router0(config-if)# ip nat outside             ! 외부망 선언
Router0(config-if)# no shutdown                ! 포트 활성화
Router0(config-if)# exit

! --- 내부 L3 스위치(백본) 연결 ---
Router0(config)# interface GigabitEthernet0/1
Router0(config-if)# ip address 172.16.1.1 255.255.255.0
Router0(config-if)# ip nat inside              ! 내부망 선언
Router0(config-if)# no shutdown
Router0(config-if)# exit

Router0(config)# interface GigabitEthernet0/2
Router0(config-if)# ip address 172.16.4.1 255.255.255.0
Router0(config-if)# ip nat inside
Router0(config-if)# no shutdown
Router0(config-if)# exit

! --- NAT 및 기본 경로 설정 ---
Router0(config)# ip route 0.0.0.0 0.0.0.0 111.111.111.1
Router0(config)# access-list 1 permit 192.168.0.0 0.0.255.255  ! 모든 내부 대역 허용
Router0(config)# ip nat inside source list 1 interface GigabitEthernet0/0 overload

! --- OSPF 라우팅 설정 : 간단하게 로드밸런싱 및 최적 경로를 찾는 프로토콜이에요. ---
Router0(config)# router ospf 1
Router0(config-router)# network 172.16.1.0 0.0.0.255 area 0   ! area 0 는 백본 에어리어를 의미해요. 이렇게 점점 에어리어가 많아져요.
Router0(config-router)# network 172.16.4.0 0.0.0.255 area 0   ! 그래도 Vlan 별로 대표 ip, priority 등 많은 타이핑을 줄요줘요.
Router0(config-router)# default-information originate ! 하단 스위치에 인터넷 경로 전파
Router0(config-router)# end
Router0# write memory

```

---

## [STEP 2] Router1 설정 (ISP 2 서비스 및 로드밸런싱)

Router1은 두 번째 ISP 회선을 통해 트래픽을 분산 처리하며 이중화를 완성합니다.

```bash
Router> enable
Router# configure terminal
Router1(config)# hostname Router1

! --- 외부 ISP 2 인터페이스 활성화 ---
Router1(config)# interface GigabitEthernet0/0
Router1(config-if)# description Link_to_ISP2
Router1(config-if)# ip address 222.222.222.2 255.255.255.252
Router1(config-if)# ip nat outside
Router1(config-if)# no shutdown
Router1(config-if)# exit

! --- 내부 L3 스위치(백본) 연결 ---
Router1(config)# interface GigabitEthernet0/1
Router1(config-if)# ip address 172.16.3.1 255.255.255.0
Router1(config-if)# ip nat inside
Router1(config-if)# no shutdown
Router1(config-if)# exit

Router1(config)# interface GigabitEthernet0/2
Router1(config-if)# ip address 172.16.2.1 255.255.255.0
Router1(config-if)# ip nat inside
Router1(config-if)# no shutdown
Router1(config-if)# exit

! --- NAT 및 기본 경로 설정 ---
Router1(config)# ip route 0.0.0.0 0.0.0.0 222.222.222.1
Router1(config)# access-list 1 permit 192.168.0.0 0.0.255.255
Router1(config)# ip nat inside source list 1 interface GigabitEthernet0/0 overload

! --- OSPF 라우팅 설정 ---
Router1(config)# router ospf 1
Router1(config-router)# network 172.16.3.0 0.0.0.255 area 0
Router1(config-router)# network 172.16.2.0 0.0.0.255 area 0
Router1(config-router)# default-information originate
Router1(config-router)# end
Router1# write memory

```

---

## [STEP 3] SW0 설정 (VLAN 10-120 Active / Priority 110)

SW0은 모든 VLAN에 대해 **Active 게이트웨이(Priority 110)** 역할을 수행하도록 구성합니다.

```bash
Switch> enable
Switch# configure terminal
SW0(config)# hostname SW0
SW0(config)# ip routing                      ! L3 라우팅 기능 활성화

! --- 라우터 연결 포트 (L3 포트로 변경) ---
SW0(config)# interface GigabitEthernet0/1
SW0(config-if)# no switchport                ! L2 기능을 끄고 IP 부여
SW0(config-if)# ip address 172.16.1.2 255.255.255.0
SW0(config-if)# no shutdown
SW0(config-if)# exit

SW0(config)# interface GigabitEthernet0/2
SW0(config-if)# no switchport
SW0(config-if)# ip address 172.16.3.2 255.255.255.0
SW0(config-if)# no shutdown
SW0(config-if)# exit

! --- 다중 VLAN (10~120) 및 HSRP 일괄 설정 ---
! * 10단위로 VLAN을 생성하고 각각 HSRP 우선순위 110 부여
SW0(config)# interface range vlan 10,20,30,40,50,60,70,80,90,100,110,120
! * 각 VLAN 인터페이스별 IP는 수동 할당이 필요하므로 예시로 VLAN 10 설정
SW0(config)# interface Vlan 10
SW0(config-if)# ip address 192.168.10.2 255.255.255.0
SW0(config-if)# standby 10 ip 192.168.10.1   ! 가상 게이트웨이 IP
SW0(config-if)# standby 10 priority 110      ! Active 권한 확보
SW0(config-if)# standby 10 preempt           ! 장애 복구 시 자동 회수
SW0(config-if)# no shutdown

! (나머지 VLAN 20~120번도 동일한 규칙으로 IP와 standby 그룹번호를 맞춰 설정합니다)

! --- OSPF 라우팅 설정 : OSPF로 간단히 로드밸런스와 failover를 해결하지만 네트워크가 복잡해지면
! 오버헤드가 커지다가 버벅대기도 합니다. 이를 대비해 위에처럼 우선권한을 주는 작업을 또 해요ㅜㅜ---
! 쉽게 하고 싶어서 만들었는데... 그래도 안전을 위해 둘 다 하는 추세입니다. 

SW0(config)# router ospf 1
SW0(config-router)# network 172.16.1.0 0.0.0.255 area 0
SW0(config-router)# network 172.16.3.0 0.0.0.255 area 0
SW0(config-router)# network 192.168.0.0 0.0.255.255 area 0
SW0(config-router)# end
SW0# write memory

```

---

## [STEP 4] SW1 설정 (VLAN 10-120 Standby / Priority 100)

SW1은 SW0 장애 시 즉시 서비스를 승계하는 대기 장비입니다.

```bash
Switch> enable
Switch# configure terminal
SW1(config)# hostname SW1
SW1(config)# ip routing

! --- 라우터 연결 포트 설정 ---
SW1(config)# interface GigabitEthernet0/1
SW1(config-if)# no switchport
SW1(config-if)# ip address 172.16.4.2 255.255.255.0
SW1(config-if)# no shutdown
SW1(config-if)# exit

SW1(config)# interface GigabitEthernet0/2
SW1(config-if)# no switchport
SW1(config-if)# ip address 172.16.2.2 255.255.255.0
SW1(config-if)# no shutdown
SW1(config-if)# exit

! --- 다중 VLAN 및 HSRP 설정 (Standby) ---
SW1(config)# interface Vlan 10
SW1(config-if)# ip address 192.168.10.3 255.255.255.0
SW1(config-if)# standby 10 ip 192.168.10.1
SW1(config-if)# standby 10 priority 100      ! 기본값 유지
SW1(config-if)# standby 10 preempt
SW1(config-if)# no shutdown

! (VLAN 20~120번도 동일한 규칙으로 Standby IP를 할당합니다)

! --- OSPF 라우팅 설정 ---
SW1(config)# router ospf 1
SW1(config-router)# network 172.16.2.0 0.0.0.255 area 0
SW1(config-router)# network 172.16.4.0 0.0.0.255 area 0
SW1(config-router)# network 192.168.0.0 0.0.255.255 area 0
SW1(config-router)# end
SW1# write memory

```
본 네트워크 구성의 최하단 계층인 **Access Layer(L2 스위치)** 설정을 추가하여 전체 계층 구조를 완성합니다. L2 스위치는 사용자 PC가 연결되는 종단 장비이며, VLAN 번호의 앞자리에 맞춰 물리 포트를 할당하는 규칙을 적용합니다.

---

## [STEP 5] Switch0 설정 (L2 Access Switch)

L2 스위치는 상단 L3 스위치(SW0, SW1)와 **Trunk**로 연결되어 여러 VLAN 트래픽을 전달하고, 각 포트에 지정된 VLAN을 할당합니다.

```bash
Switch> enable
Switch# configure terminal
Switch0(config)# hostname Switch0

! --- 상단 L3 스위치 연결 (Trunk 구성) ---
Switch0(config)# interface range GigabitEthernet0/1 - 2
Switch0(config-if-range)# switchport mode trunk    ! 여러 VLAN 트래픽이 통과하도록 설정
Switch0(config-if-range)# no shutdown
Switch0(config-if-range)# exit

! --- VLAN 생성 (10 ~ 120) ---
Switch0(config)# vlan 10,20,30,40,50,60,70,80,90,100,110,120
Switch0(config-vlan)# exit

! --- 물리 포트에 VLAN 할당 (VLAN 앞자리 번호 = 포트 번호) ---
! VLAN 10 -> Fa0/1 할당
Switch0(config)# interface FastEthernet0/1
Switch0(config-if)# switchport mode access
Switch0(config-if)# switchport access vlan 10
Switch0(config-if)# no shutdown

! VLAN 20 -> Fa0/2 할당
Switch0(config)# interface FastEthernet0/2
Switch0(config-if)# switchport mode access
Switch0(config-if)# switchport access vlan 20
Switch0(config-if)# no shutdown

! VLAN 30 -> Fa0/3 할당
Switch0(config)# interface FastEthernet0/3
Switch0(config-if)# switchport mode access
Switch0(config-if)# switchport access vlan 30
Switch0(config-if)# no shutdown

! --- (VLAN 40~120번까지 동일한 규칙으로 Fa0/4 ~ Fa0/12 포트에 할당) ---

Switch0(config)# end
Switch0# write memory                             ! 설정 저장

```

---

## 🛠️ 전체 구성 최종 점검 가이드

실패 없이 모든 설정을 마쳤다면 아래 항목을 통해 동작을 검증하세요.

1. **L2-L3 연결**: L2 스위치와 L3 스위치 사이의 링크가 **Green** 상태인지 확인하세요. (Trunk 설정 확인)
2. **HSRP 상태**: L3 스위치에서 `show standby brief`를 입력하여 **SW0은 Active**, **SW1은 Standby**인지 확인하세요.
3. **라우팅 확인**: 라우터에서 `show ip route ospf`를 통해 내부 VLAN 대역들이 모두 학습되었는지 확인하세요.
4. **최종 통신**: 각 포트에 연결된 PC에서 외부 공인 IP(예: `111.111.111.1`)로 `ping`이 나가는지 확인하세요.

---

## ⚠️ AWS 연동 시 과금 주의사항

본 실습 구성을 실제 AWS 환경과 연동(Site-to-Site VPN)할 경우 다음과 같은 비용이 발생합니다.

* **VPN 연결 비용**: 터널당 시간당 약 **$0.05** (2개 라우터 연결 시 $0.10/hr)
* **데이터 전송 비용**: AWS에서 온프레미스로 전송되는 데이터량에 따라 과금
* **팁**: 실습이 끝나면 AWS 콘솔에서 **VPN Connection**과 **Customer Gateway**를 반드시 삭제해야 불필요한 과금을 막을 수 있습니다.

Next Level : 하이브리드 클라우드 보안을 위한 ACL 기반 트래픽 제어 및 방화벽 설정

L2 포트 할당, Trunk 구성, VLAN 10~120 생성, HSRP Active/Standby 검증, no shutdown 완료
---

## 최종 구축 설계 요약

* **HSRP 이중화**: 모든 VLAN에 대해 SW0을 Active(110)로 설정하여 평상시 트래픽을 집중시키고, SW1은 Standby 상태로 대기합니다.
* **OSPF 로드밸런싱**: L3 스위치들은 두 대의 라우터로 향하는 동일 비용 경로(ECMP)를 가집니다. 이를 통해 ISP 회선 자원을 효율적으로 분산 사용합니다.
* **AWS 확장성**: 사설 대역을 `192.168.x.x`로 고정하여 AWS VPC의 기본 대역(`10.x.x.x`)과 IP가 충돌하지 않도록 설계했습니다.

---
# OSPF 외 이중화 방법

라우터에서도 스위치의 STP(Spanning Tree Protocol) 우선순위 설정과 유사하게, 특정 장비에 우선권을 주어 주 경로(Primary)와 보조 경로(Backup)를 결정하는 방법이 있습니다.

라우팅 프로토콜인 OSPF 내에서의 우선순위(DR/BDR 선출용)와는 별개로, 실제 데이터가 나가는 관문(Gateway) 자체에 우선권을 부여하는 **FHRP(First Hop Redundancy Protocol)** 기술을 주로 사용합니다.

---

### 1. HSRP / VRRP를 이용한 우선순위 설정

스위치에서 `spanning-tree vlan [ID] priority [값]`을 설정하듯, 라우터(또는 L3 스위치)에서는 **HSRP**나 **VRRP**를 사용하여 게이트웨이의 우선순위를 정할 수 있습니다.

* **개념:** 두 대의 라우터를 하나의 가상 IP(VIP)로 묶고, **Priority(우선순위)** 값이 높은 장비를 'Active(주 장비)'로 설정합니다.
* **설정 예시 (Cisco 기준):**
```bash
interface GigabitEthernet0/0
 standby 1 ip 172.16.10.254       # 가상 게이트웨이 IP
 standby 1 priority 110           # 우선순위 부여 (기본값 100, 높을수록 우선)
 standby 1 preempt                # 자신이 우선순위가 높으면 즉시 Active 권한 회수

```


> 이렇게 설정하면 Priority 110인 라우터가 메인이 되고, 100인 라우터는 대기 상태가 됩니다.



### 2. Floating Static Route (AD 값을 이용한 우선순위)

동적 라우팅 프로토콜을 쓰지 않는다면, **Administrative Distance(AD, 관리 거리)** 값을 조절하여 경로에 우선순위를 줄 수 있습니다.

* **방법:** 동일한 목적지에 대해 두 개 이상의 정적 경로를 설정하되, 보조 경로의 AD 값을 더 높게 설정합니다.
* **설정 예시:**
```bash
ip route 0.0.0.0 0.0.0.0 172.16.10.2       # 메인 경로 (기본 AD 1)
ip route 0.0.0.0 0.0.0.0 172.16.10.6 10    # 보조 경로 (AD 10으로 설정)

```


> 메인 회선이 끊기면 자동으로 AD 값이 더 큰(우선순위는 낮은) 보조 경로가 라우팅 테이블에 올라옵니다.

--- 

OSPF(Open Shortest Path First)는 대규모 엔터프라이즈 및 클라우드 하이브리드 환경에서 가장 널리 사용되는 **링크 상태(Link-State) 라우팅 프로토콜**입니다. 다익스트라(Dijkstra) 알고리즘을 기반으로 최단 경로를 계산하며, 계층적 구조를 통해 효율적인 네트워크 관리를 지원합니다.

---

### 1. OSPF의 주요 장점

* **빠른 수렴 속도 (Fast Convergence):** 네트워크 토폴로지에 변화가 생기면 즉시 LSA(Link State Advertisement)를 전송하여 변경 사항을 반영하므로, RIP 같은 거리 벡터 프로토콜에 비해 복구 속도가 매우 빠릅니다.
* **뛰어난 확장성 (Scalability):** **Area(영역)** 개념을 사용하여 네트워크를 논리적으로 분할합니다. 특정 영역 내의 상세한 토폴로지 변화가 다른 영역으로 전파되는 것을 차단하여 대규모 네트워크를 안정적으로 운영할 수 있습니다.
* **표준 프로토콜 (Open Standard):** RFC 표준으로 정의되어 있어 Cisco, Juniper, HP 등 다양한 벤더의 장비 간에 완벽한 호환성을 제공합니다.
* **효율적인 대역폭 사용:** 전체 라우팅 테이블을 주기적으로 전송하지 않고, 변화가 있을 때만 업데이트 정보를 멀티캐스트(224.0.0.5, 224.0.0.6)로 전송하여 네트워크 부하를 줄입니다.
* **Loop-free 구조:** 전체 네트워크 지도를 그린 후 최단 경로를 계산하는 방식이므로, 거리 벡터 프로토콜에서 발생하는 라우팅 루프 문제가 발생하지 않습니다.
* **VLSM 및 CIDR 지원:** 가변 길이 서브넷 마스크를 지원하여 IP 주소 공간을 낭비 없이 효율적으로 사용할 수 있습니다.

### 2. OSPF의 주요 단점

* **높은 리소스 소모:** 모든 라우터가 전체 네트워크 상태 정보(LSDB)를 유지하고 SPF 알고리즘을 실행해야 하므로, CPU와 RAM 사용량이 상대적으로 높습니다.
* **설정 및 관리의 복잡성:** 네트워크 타입(Broadcast, Point-to-Point, NBMA 등)에 따라 동작 방식이 다르고, Area 설정 및 DR/BDR 선출 등 설계 단계부터 세밀한 계획이 필요합니다.
* **계층적 설계 요구:** 반드시 **Backbone Area (Area 0)**를 중심으로 모든 영역이 연결되어야 하는 구조적 제약이 있습니다. 설계를 잘못할 경우 통신이 단절될 위험이 있습니다.
* **불균형 부하 분산 미지원:** 동일한 비용(Cost)을 가진 경로에 대해서만 부하 분산(Equal-Cost Multi-Path)을 지원합니다. EIGRP처럼 비용이 다른 경로에 가중치를 두어 분산하는 기능은 기본적으로 제공하지 않습니다.

---

### 3. 요약 및 비교 테이블

| 항목 | OSPF (Link-State) | RIP (Distance-Vector) | EIGRP (Hybrid) |
| --- | --- | --- | --- |
| **수렴 속도** | 빠름 | 느림 | 매우 빠름 |
| **확장성** | 매우 높음 (Area 단위) | 낮음 (Max 15 Hop) | 높음 |
| **리소스 사용** | 높음 (CPU/RAM) | 낮음 | 중간 |
| **호환성** | 모든 벤더 표준 | 모든 벤더 표준 | 주로 Cisco (일부 표준화) |

---

> [!NOTE]
> **AWS 연동 시 고려사항**
> AWS와 온프레미스 네트워크를 연결할 때(Direct Connect 등), 내부 라우팅은 **OSPF**를 사용하더라도 AWS 가상 프라이빗 게이트웨이(VGW)와의 연동은 주로 **BGP(Border Gateway Protocol)**를 사용합니다. 따라서 하이브리드 환경에서는 두 프로토콜 간의 **Redistribution(재분배)** 설정이 중요해집니다.

**Next Level :** OSPF Area 종류와 Stub Area 설정 방법

OSPF Area, LSA 타입, 재분배
