#  AWS 하이브리드 클라우드 통합을 위한 엔터프라이즈 네트워크 인프라 설계
<img width="2513" height="1261" alt="image" src="https://github.com/user-attachments/assets/761bd577-0ca7-4320-8240-133c03de6bdc" />



## 1. 개요 및 설계 원칙

본 섹션에서는 업데이트된 토폴로지를 기반으로, AWS 하이브리드 클라우드 연동을 대비한 엔터프라이즈 네트워크 인프라 구성을 다룹니다.

### 1.1 설계 핵심 사항

* **VLAN 확장:** 부서 및 서버 그룹의 세분화를 위해 HQ에는 VLAN 10, 30, 40, 50을, 지사(Branch)에는 VLAN 150, 160, 170, 180을 할당합니다.
* **IP 주소 분리:** AWS VPC(`10.0.0.0/16`)와의 충돌 방지를 위해 사설망은 `172.16.x.x` 및 `192.168.x.x`(HQ), `192.170.x.x`(Branch) 대역을 엄격히 구분하여 사용합니다.
* **HSRP 이중화:** MSW1을 Active(Priority 110), MSW2를 Standby(Priority 100)로 설정하여 모든 VLAN에 대한 게이트웨이 이중화를 구현합니다.

---

## 2. 장비별 상세 CLI 구성 (Detailed CLI Configuration by Device)

이미지의 토폴로지에 맞춰 확장된 VLAN 구성을 포함한 각 장비별 설정 과정입니다.

### 2.1 HQ Edge Router 1 (R1)

ISP 1회선 및 내부 코어 스위치(MSW1, MSW2)와 연결합니다.

```bash
Router> enable
Router# configure terminal
Router(config)# hostname R1

! -- 1. WAN (ISP1) 인터페이스 설정 --
R1(config)# interface GigabitEthernet0/0
R1(config-if)# description Link_to_ISP1
R1(config-if)# ip address 111.111.111.2 255.255.255.252
R1(config-if)# no shutdown
R1(config-if)# exit

! -- 2. LAN (Core Switch) 인터페이스 설정 --
R1(config)# interface GigabitEthernet0/1
R1(config-if)# description Link_to_MSW1
R1(config-if)# ip address 172.16.1.1 255.255.255.0
R1(config-if)# no shutdown
R1(config-if)# exit

R1(config)# interface GigabitEthernet0/2
R1(config-if)# description Link_to_MSW2
R1(config-if)# ip address 172.16.4.1 255.255.255.0
R1(config-if)# no shutdown
R1(config-if)# exit

! -- 3. OSPF 라우팅 설정 --
R1(config)# router ospf 1
R1(config-router)# router-id 1.1.1.1
R1(config-router)# network 172.16.0.0 0.0.255.255 area 0
R1(config-router)# default-information originate
R1(config-router)# exit

! -- 4. Default Route 설정 --
R1(config)# ip route 0.0.0.0 0.0.0.0 111.111.111.1
R1(config)# end
R1# write memory

```

### 2.2 HQ Edge Router 2 (R2)

ISP 2회선 및 내부 코어 스위치와 연결되는 예비 경로 라우터입니다.

```bash
Router> enable
Router# configure terminal
Router(config)# hostname R2

! -- 1. WAN (ISP2) 인터페이스 설정 --
R2(config)# interface GigabitEthernet0/0
R2(config-if)# description Link_to_ISP2
R2(config-if)# ip address 222.222.222.2 255.255.255.252
R2(config-if)# no shutdown
R2(config-if)# exit

! -- 2. LAN (Core Switch) 인터페이스 설정 --
R2(config)# interface GigabitEthernet0/1
R2(config-if)# description Link_to_MSW2
R2(config-if)# ip address 172.16.2.1 255.255.255.0
R2(config-if)# no shutdown
R2(config-if)# exit

R2(config)# interface GigabitEthernet0/2
R2(config-if)# description Link_to_MSW1
R2(config-if)# ip address 172.16.3.1 255.255.255.0
R2(config-if)# no shutdown
R2(config-if)# exit

! -- 3. OSPF 라우팅 설정 --
R2(config)# router ospf 1
R2(config-router)# router-id 2.2.2.2
R2(config-router)# network 172.16.0.0 0.0.255.255 area 0
R2(config-router)# default-information originate
R2(config-router)# exit

! -- 4. Default Route 설정 --
R2(config)# ip route 0.0.0.0 0.0.0.0 222.222.222.1
R2(config)# end
R2# write memory

```

### 2.3 HQ Core Switch 1 (MSW1) - **Active Gateway**

새롭게 추가된 VLAN(30, 40, 50)을 포함하여 모든 VLAN에 대해 **HSRP Active (Priority 110)** 설정을 적용합니다.

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname MSW1
Switch(config)# ip routing

! -- 1. VLAN 데이터베이스 생성 (확장됨) --
MSW1(config)# vlan 10
MSW1(config-vlan)# name HQ_User
MSW1(config-vlan)# exit
MSW1(config)# vlan 30
MSW1(config-vlan)# name HQ_Server_Grp1
MSW1(config-vlan)# exit
MSW1(config)# vlan 40
MSW1(config-vlan)# name HQ_Server_Grp2
MSW1(config-vlan)# exit
MSW1(config)# vlan 50
MSW1(config-vlan)# name HQ_Server_Grp3
MSW1(config-vlan)# exit

! -- 2. SVI 및 HSRP Active 설정 (Priority 110 & Preempt) --
! VLAN 10
MSW1(config)# interface Vlan10
MSW1(config-if)# ip address 192.168.10.2 255.255.255.0
MSW1(config-if)# standby 10 ip 192.168.10.1
MSW1(config-if)# standby 10 priority 110
MSW1(config-if)# standby 10 preempt
MSW1(config-if)# no shutdown
MSW1(config-if)# exit

! VLAN 30
MSW1(config)# interface Vlan30
MSW1(config-if)# ip address 192.168.30.2 255.255.255.0
MSW1(config-if)# standby 30 ip 192.168.30.1
MSW1(config-if)# standby 30 priority 110
MSW1(config-if)# standby 30 preempt
MSW1(config-if)# no shutdown
MSW1(config-if)# exit

! VLAN 40
MSW1(config)# interface Vlan40
MSW1(config-if)# ip address 192.168.40.2 255.255.255.0
MSW1(config-if)# standby 40 ip 192.168.40.1
MSW1(config-if)# standby 40 priority 110
MSW1(config-if)# standby 40 preempt
MSW1(config-if)# no shutdown
MSW1(config-if)# exit

! VLAN 50
MSW1(config)# interface Vlan50
MSW1(config-if)# ip address 192.168.50.2 255.255.255.0
MSW1(config-if)# standby 50 ip 192.168.50.1
MSW1(config-if)# standby 50 priority 110
MSW1(config-if)# standby 50 preempt
MSW1(config-if)# no shutdown
MSW1(config-if)# exit

! -- 3. Uplink (Routed Ports) --
MSW1(config)# interface GigabitEthernet1/0/1
MSW1(config-if)# description Link_to_R1
MSW1(config-if)# no switchport
MSW1(config-if)# ip address 172.16.1.2 255.255.255.0
MSW1(config-if)# no shutdown
MSW1(config-if)# exit

MSW1(config)# interface GigabitEthernet1/0/2
MSW1(config-if)# description Link_to_R2
MSW1(config-if)# no switchport
MSW1(config-if)# ip address 172.16.3.2 255.255.255.0
MSW1(config-if)# no shutdown
MSW1(config-if)# exit

MSW1(config)# interface GigabitEthernet1/0/24
MSW1(config-if)# description Link_to_R3
MSW1(config-if)# no switchport
MSW1(config-if)# ip address 172.16.5.1 255.255.255.0
MSW1(config-if)# no shutdown
MSW1(config-if)# exit

! -- 4. Downlink (Trunk to Access Switches) --
MSW1(config)# interface range GigabitEthernet1/0/3 - 4
MSW1(config-if-range)# description Link_to_Access_Switches
MSW1(config-if-range)# switchport trunk encapsulation dot1q
MSW1(config-if-range)# switchport mode trunk
MSW1(config-if-range)# no shutdown
MSW1(config-if-range)# exit

! -- 5. OSPF 설정 --
MSW1(config)# router ospf 1
MSW1(config-router)# router-id 10.10.10.1
MSW1(config-router)# network 172.16.0.0 0.0.255.255 area 0
MSW1(config-router)# network 192.168.10.0 0.0.0.255 area 0
MSW1(config-router)# network 192.168.30.0 0.0.0.255 area 0
MSW1(config-router)# network 192.168.40.0 0.0.0.255 area 0
MSW1(config-router)# network 192.168.50.0 0.0.0.255 area 0
MSW1(config-router)# end
MSW1# write memory

```

### 2.4 HQ Core Switch 2 (MSW2) - **Standby Gateway**

모든 VLAN(10, 30, 40, 50)에 대해 **HSRP Standby (Priority 100)** 설정을 적용합니다.

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname MSW2
Switch(config)# ip routing

! -- 1. VLAN 데이터베이스 생성 --
MSW2(config)# vlan 10
MSW2(config)# vlan 30
MSW2(config)# vlan 40
MSW2(config)# vlan 50

! -- 2. SVI 및 HSRP Standby 설정 --
! VLAN 10
MSW2(config)# interface Vlan10
MSW2(config-if)# ip address 192.168.10.3 255.255.255.0
MSW2(config-if)# standby 10 ip 192.168.10.1
MSW2(config-if)# no shutdown
MSW2(config-if)# exit

! VLAN 30
MSW2(config)# interface Vlan30
MSW2(config-if)# ip address 192.168.30.3 255.255.255.0
MSW2(config-if)# standby 30 ip 192.168.30.1
MSW2(config-if)# no shutdown
MSW2(config-if)# exit

! VLAN 40
MSW2(config)# interface Vlan40
MSW2(config-if)# ip address 192.168.40.3 255.255.255.0
MSW2(config-if)# standby 40 ip 192.168.40.1
MSW2(config-if)# no shutdown
MSW2(config-if)# exit

! VLAN 50
MSW2(config)# interface Vlan50
MSW2(config-if)# ip address 192.168.50.3 255.255.255.0
MSW2(config-if)# standby 50 ip 192.168.50.1
MSW2(config-if)# no shutdown
MSW2(config-if)# exit

! -- 3. Uplink (Routed Ports) --
MSW2(config)# interface GigabitEthernet1/0/1
MSW2(config-if)# description Link_to_R2
MSW2(config-if)# no switchport
MSW2(config-if)# ip address 172.16.2.2 255.255.255.0
MSW2(config-if)# no shutdown
MSW2(config-if)# exit

MSW2(config)# interface GigabitEthernet1/0/2
MSW2(config-if)# description Link_to_R1
MSW2(config-if)# no switchport
MSW2(config-if)# ip address 172.16.4.2 255.255.255.0
MSW2(config-if)# no shutdown
MSW2(config-if)# exit

MSW2(config)# interface GigabitEthernet1/0/24
MSW2(config-if)# description Link_to_R3
MSW2(config-if)# no switchport
MSW2(config-if)# ip address 172.16.5.2 255.255.255.0
MSW2(config-if)# no shutdown
MSW2(config-if)# exit

! -- 4. Downlink (Trunk to Access Switches) --
MSW2(config)# interface range GigabitEthernet1/0/3 - 4
MSW2(config-if-range)# description Link_to_Access_Switches
MSW2(config-if-range)# switchport trunk encapsulation dot1q
MSW2(config-if-range)# switchport mode trunk
MSW2(config-if-range)# no shutdown
MSW2(config-if-range)# exit

! -- 5. OSPF 설정 --
MSW2(config)# router ospf 1
MSW2(config-router)# router-id 10.10.10.2
MSW2(config-router)# network 172.16.0.0 0.0.255.255 area 0
MSW2(config-router)# network 192.168.10.0 0.0.0.255 area 0
MSW2(config-router)# network 192.168.30.0 0.0.0.255 area 0
MSW2(config-router)# network 192.168.40.0 0.0.0.255 area 0
MSW2(config-router)# network 192.168.50.0 0.0.0.255 area 0
MSW2(config-router)# end
MSW2# write memory

```

### 2.5 HQ Access Switch (서버 및 사용자용)

**사용자 PC 및 서버가 연결되는 포트에 VLAN을 할당**합니다. 도면에 따라 VLAN 10, 30, 40, 50을 물리 포트에 매핑합니다.

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname HQ_Access_SW

! -- 1. VLAN 생성 --
HQ_Access_SW(config)# vlan 10
HQ_Access_SW(config)# vlan 30
HQ_Access_SW(config)# vlan 40
HQ_Access_SW(config)# vlan 50

! -- 2. Uplink 설정 (Core 연결 Trunk) --
HQ_Access_SW(config)# interface range GigabitEthernet0/1 - 2
HQ_Access_SW(config-if-range)# description Uplink_to_MSW
HQ_Access_SW(config-if-range)# switchport trunk encapsulation dot1q
HQ_Access_SW(config-if-range)# switchport mode trunk
HQ_Access_SW(config-if-range)# no shutdown
HQ_Access_SW(config-if-range)# exit

! -- 3. Access Port 할당 (VLAN 10: PC) --
HQ_Access_SW(config)# interface FastEthernet0/1
HQ_Access_SW(config-if)# description User_PC_Vlan10
HQ_Access_SW(config-if)# switchport mode access
HQ_Access_SW(config-if)# switchport access vlan 10
HQ_Access_SW(config-if)# no shutdown
HQ_Access_SW(config-if)# exit

! -- 4. Access Port 할당 (VLAN 30: Groupware Server) --
HQ_Access_SW(config)# interface FastEthernet0/10
HQ_Access_SW(config-if)# description Server_Groupware_Vlan30
HQ_Access_SW(config-if)# switchport mode access
HQ_Access_SW(config-if)# switchport access vlan 30
HQ_Access_SW(config-if)# no shutdown
HQ_Access_SW(config-if)# exit

! -- 5. Access Port 할당 (VLAN 40: Server 12/13) --
HQ_Access_SW(config)# interface range FastEthernet0/11 - 12
HQ_Access_SW(config-if-range)# description Servers_Vlan40
HQ_Access_SW(config-if-range)# switchport mode access
HQ_Access_SW(config-if-range)# switchport access vlan 40
HQ_Access_SW(config-if-range)# no shutdown
HQ_Access_SW(config-if-range)# exit

! -- 6. Access Port 할당 (VLAN 50: Server 14) --
HQ_Access_SW(config)# interface FastEthernet0/13
HQ_Access_SW(config-if)# description Server_Vlan50
HQ_Access_SW(config-if)# switchport mode access
HQ_Access_SW(config-if)# switchport access vlan 50
HQ_Access_SW(config-if)# no shutdown
HQ_Access_SW(config-if)# end
HQ_Access_SW# write memory

```

### 2.6 HQ Internal Router (R3)

본사 코어 스위치와 지사를 연결합니다.

```bash
Router> enable
Router# configure terminal
Router(config)# hostname R3

! -- 1. 본사 Core 연결 --
R3(config)# interface GigabitEthernet0/0
R3(config-if)# description Link_to_HQ_Core
R3(config-if)# ip address 172.16.5.254 255.255.255.0
R3(config-if)# no shutdown
R3(config-if)# exit

! -- 2. 지사 WAN 연결 --
R3(config)# interface GigabitEthernet0/1
R3(config-if)# description Link_to_Branch_R4
R3(config-if)# ip address 172.16.6.1 255.255.255.0
R3(config-if)# no shutdown
R3(config-if)# exit

! -- 3. OSPF 설정 --
R3(config)# router ospf 1
R3(config-router)# network 172.16.0.0 0.0.255.255 area 0
R3(config-router)# end
R3# write memory

```

### 2.7 Branch Edge Router (R4)

지사 관문 라우터입니다.

```bash
Router> enable
Router# configure terminal
Router(config)# hostname R4

! -- 1. 본사 WAN 연결 --
R4(config)# interface GigabitEthernet0/0
R4(config-if)# description Link_to_HQ_R3
R4(config-if)# ip address 172.16.6.2 255.255.255.0
R4(config-if)# no shutdown
R4(config-if)# exit

! -- 2. 지사 내부 연결 --
R4(config)# interface GigabitEthernet0/1
R4(config-if)# description Link_to_Branch_Switch
R4(config-if)# ip address 172.16.8.1 255.255.255.0
R4(config-if)# no shutdown# Chapter 3. AWS 하이브리드 클라우드 통합을 위한 엔터프라이즈 전체 네트워크 구축

## 1. 개요 및 설계 원칙

본 챕터에서는 **인터넷 연결(ISP) - 엣지(Edge) - 코어(Core) - 액세스(Access) - 지사(Branch)** 로 이어지는 전체 엔터프라이즈 네트워크 인프라를 구축합니다.

### 1.1 통합 설계 핵심 사항

1. **전 구간 연결성 확보:** ISP부터 내부 단말까지 끊김 없는 L2/L3 연결 구성.
2. **AWS 연동 대비:** 사설 IP 대역(`172.16.x.x`, `192.168.x.x`, `192.170.x.x`)을 엄격히 준수하여 AWS VPC(`10.0.0.0/16`)와 충돌 방지.
3. **고가용성(HA):** 본사 Core(MSW) 계층의 **HSRP** 구성 및 OSPF 라우팅을 통한 경로 이중화.
4. **보안 및 세분화:** 부서(VLAN 10, 30, 40)와 서버(VLAN 20, 50), 지사(VLAN 150~180)망의 논리적 분리 및 NAT 구성.

---

## 2. Phase 1: 인터넷 및 Edge 구간 (ISP, Backbone L2, R1/R2)

외부 인터넷 연결을 시뮬레이션하고, 본사 유입 관문인 라우터와 백본 스위치를 설정합니다.

### 2.1 ISP Router (인터넷 시뮬레이션)

```bash
Router> enable
Router# configure terminal
Router(config)# hostname ISP_Router

! -- 1. 인터넷 테스트용 Loopback --
ISP_Router(config)# interface Loopback0
ISP_Router(config-if)# ip address 8.8.8.8 255.255.255.255
ISP_Router(config-if)# exit

! -- 2. R1/R2 연결 인터페이스 --
ISP_Router(config)# interface GigabitEthernet0/0
ISP_Router(config-if)# description Link_to_R1
ISP_Router(config-if)# ip address 111.111.111.1 255.255.255.252
ISP_Router(config-if)# no shutdown
ISP_Router(config-if)# exit

ISP_Router(config)# interface GigabitEthernet0/1
ISP_Router(config-if)# description Link_to_R2
ISP_Router(config-if)# ip address 222.222.222.1 255.255.255.252
ISP_Router(config-if)# no shutdown
ISP_Router(config-if)# exit

```

### 2.2 Backbone L2 Switch (Switch13)

R1, R2와 MSW1, MSW2 사이의 물리적 연결을 중계하는 L2 스위치입니다.

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname Switch13

! -- 라우터 및 코어 스위치 연결 포트 활성화 --
Switch13(config)# interface range FastEthernet0/1 - 24
Switch13(config-if-range)# description Backbone_Mesh_Links
Switch13(config-if-range)# switchport mode access
Switch13(config-if-range)# switchport access vlan 1
Switch13(config-if-range)# no shutdown
Switch13(config-if-range)# end
Switch13# write memory

```

### 2.3 HQ Edge Router 1 (R1) - NAT & OSPF

```bash
Router> enable
Router# configure terminal
Router(config)# hostname R1

! -- 1. WAN/LAN 인터페이스 및 NAT 방향 설정 --
R1(config)# interface GigabitEthernet0/0
R1(config-if)# description Link_to_ISP1
R1(config-if)# ip address 111.111.111.2 255.255.255.252
R1(config-if)# ip nat outside
R1(config-if)# no shutdown
R1(config-if)# exit

R1(config)# interface GigabitEthernet0/1
R1(config-if)# description Link_to_MSW1
R1(config-if)# ip address 172.16.1.1 255.255.255.0
R1(config-if)# ip nat inside
R1(config-if)# no shutdown
R1(config-if)# exit

R1(config)# interface GigabitEthernet0/2
R1(config-if)# description Link_to_MSW2
R1(config-if)# ip address 172.16.4.1 255.255.255.0
R1(config-if)# ip nat inside
R1(config-if)# no shutdown
R1(config-if)# exit

! -- 2. NAT 및 라우팅 설정 --
R1(config)# access-list 1 permit 192.168.0.0 0.0.255.255
R1(config)# access-list 1 permit 172.16.0.0 0.0.255.255
R1(config)# ip nat inside source list 1 interface GigabitEthernet0/0 overload

R1(config)# router ospf 1
R1(config-router)# router-id 1.1.1.1
R1(config-router)# network 172.16.0.0 0.0.255.255 area 0
R1(config-router)# default-information originate
R1(config-router)# exit
R1(config)# ip route 0.0.0.0 0.0.0.0 111.111.111.1

```

### 2.4 HQ Edge Router 2 (R2) - NAT & OSPF

```bash
Router> enable
Router# configure terminal
Router(config)# hostname R2

! -- 1. WAN/LAN 인터페이스 --
R2(config)# interface GigabitEthernet0/0
R2(config-if)# description Link_to_ISP2
R2(config-if)# ip address 222.222.222.2 255.255.255.252
R2(config-if)# ip nat outside
R2(config-if)# no shutdown
R2(config-if)# exit

R2(config)# interface GigabitEthernet0/1
R2(config-if)# ip address 172.16.2.1 255.255.255.0
R2(config-if)# ip nat inside
R2(config-if)# no shutdown
R2(config-if)# exit

R2(config)# interface GigabitEthernet0/2
R2(config-if)# ip address 172.16.3.1 255.255.255.0
R2(config-if)# ip nat inside
R2(config-if)# no shutdown
R2(config-if)# exit

! -- 2. NAT 및 라우팅 --
R2(config)# access-list 1 permit 192.168.0.0 0.0.255.255
R2(config)# access-list 1 permit 172.16.0.0 0.0.255.255
R2(config)# ip nat inside source list 1 interface GigabitEthernet0/0 overload

R2(config)# router ospf 1
R2(config-router)# router-id 2.2.2.2
R2(config-router)# network 172.16.0.0 0.0.255.255 area 0
R2(config-router)# default-information originate
R2(config-router)# exit
R2(config)# ip route 0.0.0.0 0.0.0.0 222.222.222.1

```

---

## 3. Phase 2: HQ Core Layer (HSRP Gateway)

본사의 모든 VLAN 게이트웨이 역할을 수행하며 이중화를 구성합니다.

### 3.1 HQ Core Switch 1 (MSW1) - Active (Priority 110)

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname MSW1
Switch(config)# ip routing

! -- 1. VLAN 생성 (10, 20, 30, 40, 50) --
MSW1(config)# vlan 10
MSW1(config)# vlan 20
MSW1(config)# vlan 30
MSW1(config)# vlan 40
MSW1(config)# vlan 50

! -- 2. SVI 및 HSRP Active 설정 --
! (반복되는 패턴이므로 주요 VLAN 예시, 모든 VLAN에 적용 필요)
MSW1(config)# interface Vlan10
MSW1(config-if)# ip address 192.168.10.2 255.255.255.0
MSW1(config-if)# standby 10 ip 192.168.10.1
MSW1(config-if)# standby 10 priority 110
MSW1(config-if)# standby 10 preempt
MSW1(config-if)# no shutdown

MSW1(config)# interface Vlan20
MSW1(config-if)# ip address 192.168.20.2 255.255.255.0
MSW1(config-if)# standby 20 ip 192.168.20.1
MSW1(config-if)# standby 20 priority 110
MSW1(config-if)# standby 20 preempt
MSW1(config-if)# no shutdown
! (VLAN 30, 40, 50도 동일 패턴으로 Priority 110/Preempt 설정)

! -- 3. Uplink (Routed Ports) --
MSW1(config)# interface GigabitEthernet1/0/1
MSW1(config-if)# no switchport
MSW1(config-if)# ip address 172.16.1.2 255.255.255.0
MSW1(config-if)# no shutdown
MSW1(config)# interface GigabitEthernet1/0/2
MSW1(config-if)# no switchport
MSW1(config-if)# ip address 172.16.3.2 255.255.255.0
MSW1(config-if)# no shutdown
MSW1(config)# interface GigabitEthernet1/0/24
MSW1(config-if)# no switchport
MSW1(config-if)# ip address 172.16.5.1 255.255.255.0
MSW1(config-if)# no shutdown

! -- 4. Downlink (Trunk to L2 Switches) --
MSW1(config)# interface range GigabitEthernet1/0/3 - 4
MSW1(config-if-range)# switchport trunk encapsulation dot1q
MSW1(config-if-range)# switchport mode trunk
MSW1(config-if-range)# no shutdown

! -- 5. OSPF --
MSW1(config)# router ospf 1
MSW1(config-router)# network 172.16.0.0 0.0.255.255 area 0
MSW1(config-router)# network 192.168.0.0 0.0.255.255 area 0

```

### 3.2 HQ Core Switch 2 (MSW2) - Standby

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname MSW2
Switch(config)# ip routing

! -- 1. VLAN 생성 및 HSRP Standby --
MSW2(config)# vlan 10
MSW2(config)# vlan 20
MSW2(config)# vlan 30
MSW2(config)# vlan 40
MSW2(config)# vlan 50

MSW2(config)# interface Vlan10
MSW2(config-if)# ip address 192.168.10.3 255.255.255.0
MSW2(config-if)# standby 10 ip 192.168.10.1
MSW2(config-if)# no shutdown
! (나머지 VLAN 20, 30, 40, 50도 동일하게 Standby IP 설정)

! -- 2. Uplink 및 Downlink --
MSW2(config)# interface GigabitEthernet1/0/1
MSW2(config-if)# no switchport
MSW2(config-if)# ip address 172.16.2.2 255.255.255.0
MSW2(config)# interface GigabitEthernet1/0/2
MSW2(config-if)# no switchport
MSW2(config-if)# ip address 172.16.4.2 255.255.255.0
MSW2(config)# interface GigabitEthernet1/0/24
MSW2(config-if)# no switchport
MSW2(config-if)# ip address 172.16.5.2 255.255.255.0

MSW2(config)# interface range GigabitEthernet1/0/3 - 4
MSW2(config-if-range)# switchport trunk encapsulation dot1q
MSW2(config-if-range)# switchport mode trunk
MSW2(config-if-range)# no shutdown

! -- 3. OSPF --
MSW2(config)# router ospf 1
MSW2(config-router)# network 172.16.0.0 0.0.255.255 area 0
MSW2(config-router)# network 192.168.0.0 0.0.255.255 area 0

```

---

## 4. Phase 3: HQ Access Layer (L2 Switches)

사용자 및 서버를 위한 물리 포트 VLAN 할당을 수행합니다.

### 4.1 HQ User Access L2 (좌측: 부서별)

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname HQ_Access_User

! -- VLAN 생성 및 Trunk 설정 --
HQ_Access_User(config)# vlan 10
HQ_Access_User(config)# vlan 30
HQ_Access_User(config)# vlan 40
HQ_Access_User(config)# vlan 50
HQ_Access_User(config)# interface range GigabitEthernet0/1 - 2
HQ_Access_User(config-if-range)# switchport trunk encapsulation dot1q
HQ_Access_User(config-if-range)# switchport mode trunk
HQ_Access_User(config-if-range)# no shutdown

! -- Access Port 할당 --
! 임원/마케팅 (VLAN 10)
HQ_Access_User(config)# interface range FastEthernet0/1 - 5
HQ_Access_User(config-if-range)# switchport mode access
HQ_Access_User(config-if-range)# switchport access vlan 10
HQ_Access_User(config-if-range)# spanning-tree portfast

! 전략기획 (VLAN 30)
HQ_Access_User(config)# interface range FastEthernet0/6 - 10
HQ_Access_User(config-if-range)# switchport mode access
HQ_Access_User(config-if-range)# switchport access vlan 30

! R&D (VLAN 40)
HQ_Access_User(config)# interface range FastEthernet0/11 - 15
HQ_Access_User(config-if-range)# switchport mode access
HQ_Access_User(config-if-range)# switchport access vlan 40

! 예비 (VLAN 50)
HQ_Access_User(config)# interface range FastEthernet0/16 - 24
HQ_Access_User(config-if-range)# switchport mode access
HQ_Access_User(config-if-range)# switchport access vlan 50

```

### 4.2 HQ Server Access L2 (중앙: 서버팜)

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname HQ_Access_Server

! -- VLAN 20 생성 및 Trunk --
HQ_Access_Server(config)# vlan 20
HQ_Access_Server(config-vlan)# name Server_Farm
HQ_Access_Server(config)# interface range GigabitEthernet0/1 - 2
HQ_Access_Server(config-if-range)# switchport trunk encapsulation dot1q
HQ_Access_Server(config-if-range)# switchport mode trunk

! -- Server Port 할당 --
HQ_Access_Server(config)# interface range FastEthernet0/1 - 24
HQ_Access_Server(config-if-range)# switchport mode access
HQ_Access_Server(config-if-range)# switchport access vlan 20
HQ_Access_Server(config-if-range)# spanning-tree portfast

```

---

## 5. Phase 4: HQ-Branch WAN Connection

### 5.1 HQ Internal Router (R3)

```bash
Router> enable
Router# configure terminal
Router(config)# hostname R3

R3(config)# interface GigabitEthernet0/0
R3(config-if)# ip address 172.16.5.254 255.255.255.0
R3(config-if)# no shutdown

R3(config)# interface GigabitEthernet0/1
R3(config-if)# ip address 172.16.6.1 255.255.255.0
R3(config-if)# no shutdown

R3(config)# router ospf 1
R3(config-router)# network 172.16.0.0 0.0.255.255 area 0

```

### 5.2 Branch Edge Router (R4)

```bash
Router> enable
Router# configure terminal
Router(config)# hostname R4

R4(config)# interface GigabitEthernet0/0
R4(config-if)# ip address 172.16.6.2 255.255.255.0
R4(config-if)# no shutdown

R4(config)# interface GigabitEthernet0/1
R4(config-if)# ip address 172.16.8.1 255.255.255.0
R4(config-if)# no shutdown

R4(config)# router ospf 1
R4(config-router)# network 172.16.0.0 0.0.255.255 area 0

```

---

## 6. Phase 5: Branch Internal Network

지사는 L3 스위치를 Core로 사용하고 하단에 L2 스위치를 두어 VLAN을 분리합니다.

### 6.1 Branch Core Switch (L3_Branch)

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname L3_Branch
Switch(config)# ip routing

! -- VLAN Gateway (SVI) --
L3_Branch(config)# vlan 150
L3_Branch(config)# vlan 160
L3_Branch(config)# vlan 170
L3_Branch(config)# vlan 180

L3_Branch(config)# interface Vlan150
L3_Branch(config-if)# ip address 192.170.150.1 255.255.255.0
L3_Branch(config-if)# no shutdown
! (VLAN 160, 170, 180도 동일 대역 규칙에 맞춰 IP 설정)

! -- Uplink (Routed) --
L3_Branch(config)# interface GigabitEthernet0/1
L3_Branch(config-if)# no switchport
L3_Branch(config-if)# ip address 172.16.8.2 255.255.255.0
L3_Branch(config-if)# no shutdown

! -- Downlink (Trunk to L2 Switches) --
L3_Branch(config)# interface range GigabitEthernet0/2 - 3
L3_Branch(config-if-range)# switchport trunk encapsulation dot1q
L3_Branch(config-if-range)# switchport mode trunk
L3_Branch(config-if-range)# no shutdown

! -- OSPF --
L3_Branch(config)# router ospf 1
L3_Branch(config-router)# network 172.16.0.0 0.0.255.255 area 0
L3_Branch(config-router)# network 192.170.0.0 0.0.255.255 area 0

```

### 6.2 Branch Access L2 Switches

#### **A. Branch Upper L2 (VLAN 150, 160)**

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname Branch_SW_Upper

Branch_SW_Upper(config)# vlan 150
Branch_SW_Upper(config)# vlan 160

! -- Uplink Trunk --
Branch_SW_Upper(config)# interface GigabitEthernet0/1
Branch_SW_Upper(config-if)# switchport mode trunk
Branch_SW_Upper(config-if)# no shutdown

! -- Access Ports --
Branch_SW_Upper(config)# interface range FastEthernet0/1 - 10
Branch_SW_Upper(config-if-range)# switchport mode access
Branch_SW_Upper(config-if-range)# switchport access vlan 150

Branch_SW_Upper(config)# interface range FastEthernet0/11 - 20
Branch_SW_Upper(config-if-range)# switchport mode access
Branch_SW_Upper(config-if-range)# switchport access vlan 160

```

#### **B. Branch Lower L2 (VLAN 170, 180)**

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname Branch_SW_Lower

Branch_SW_Lower(config)# vlan 170
Branch_SW_Lower(config)# vlan 180

! -- Uplink Trunk --
Branch_SW_Lower(config)# interface GigabitEthernet0/1
Branch_SW_Lower(config-if)# switchport mode trunk
Branch_SW_Lower(config-if)# no shutdown

! -- Access Ports --
Branch_SW_Lower(config)# interface range FastEthernet0/1 - 10
Branch_SW_Lower(config-if-range)# switchport mode access
Branch_SW_Lower(config-if-range)# switchport access vlan 170

Branch_SW_Lower(config)# interface range FastEthernet0/11 - 20
Branch_SW_Lower(config-if-range)# switchport mode access
Branch_SW_Lower(config-if-range)# switchport access vlan 180

```

Next Level : AWS VPC 생성 및 Site-to-Site VPN 연결 설정
