# Chapter 4. Security Policy Implementation (ACL Configuration)

## 1. 보안 정책 개요 및 설계

본 섹션에서는 특정 서버(R&D 개발 서버, 보안 서버)에 대한 접근 통제를 구현합니다. 불필요한 접근을 차단하여 내부 정보 유출을 방지하고 보안성을 강화하는 것이 목적입니다.

### 1.1 정책 요구사항 분석

* **보호 대상 자산 (Protected Assets):**
* **R&D 개발 서버:** `192.168.20.12` (가정)
* **Security 서버:** `192.168.20.14` (가정)


* **접근 허용 그룹 (Permitted Source):**
* **임원실 (Executives):** VLAN 10 (`192.168.10.0/24`)
* **R&D 부서:** VLAN 40 (`192.168.40.0/24`)


* **접근 차단 그룹 (Denied Source):**
* 위 허용 그룹을 제외한 모든 네트워크 (마케팅, 전략기획, 지사, 외부망 등)



### 1.2 최적의 장비 선정 (Placement Strategy)

ACL(Access Control List)은 트래픽이 모이는 게이트웨이에서 수행하는 것이 가장 효율적입니다.

* **선정 장비:** **HQ Core Switch (MSW1, MSW2)**
* **적용 위치:** **Vlan 20 (Server Farm) 인터페이스**
* **적용 방향:** **Outbound** (라우터/스위치 내부에서 서버팜 방향으로 나가는 트래픽)
* *이유:* 모든 사용자 VLAN의 트래픽은 라우팅되어 VLAN 20 인터페이스를 통해 서버로 전달되므로, 목적지(Server) 바로 앞에서 필터링하는 것이 정책 관리상 가장 명확합니다.



---

## 2. ACL 구성 스크립트 (ACL Configuration Script)

MSW1(Active)과 MSW2(Standby) 모두 동일하게 설정해야 HSRP 절체 시에도 보안 정책이 유지됩니다.

### 2.1 IP 주소 및 객체 정의 (사전 가정)

설정을 위해 서버 IP를 아래와 같이 특정합니다. (실제 환경에 맞게 IP 수정 가능)

* **R&D 서버:** 192.168.20.12
* **Security 서버:** 192.168.20.14

### 2.2 HQ Core Switch 1 (MSW1) 설정

확장형 ACL(Extended ACL)을 사용하여 출발지 IP와 목적지 IP를 모두 검사합니다.

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname MSW1

! -- 1. 확장 ACL 생성: 이름 'SECURE_SERVER_ACCESS' --
MSW1(config)# ip access-list extended SECURE_SERVER_ACCESS

! -- 2. [허용] 임원실(VLAN 10) -> R&D/Security 서버 접근 --
! (참고: VLAN 10에 마케팅팀이 섞여 있다면 특정 IP(host)로 제한하는 것이 더 안전합니다. 여기선 대역 전체 허용)
MSW1(config-ext-nacl)# permit ip 192.168.10.0 0.0.0.255 host 192.168.20.12
MSW1(config-ext-nacl)# permit ip 192.168.10.0 0.0.0.255 host 192.168.20.14

! -- 3. [허용] R&D부서(VLAN 40) -> R&D/Security 서버 접근 --
MSW1(config-ext-nacl)# permit ip 192.168.40.0 0.0.0.255 host 192.168.20.12
MSW1(config-ext-nacl)# permit ip 192.168.40.0 0.0.0.255 host 192.168.20.14

! -- 4. [차단] 그 외 모든 곳에서 해당 서버들로의 접근 거부 --
MSW1(config-ext-nacl)# deny ip any host 192.168.20.12
MSW1(config-ext-nacl)# deny ip any host 192.168.20.14

! -- 5. [허용] 나머지 트래픽 허용 (필수) --
! 이 줄이 없으면 그룹웨어, 메일서버 등 다른 서버 접속도 모두 차단됨
MSW1(config-ext-nacl)# permit ip any any
MSW1(config-ext-nacl)# exit

! -- 6. 인터페이스 적용 (VLAN 20 Outbound) --
MSW1(config)# interface Vlan20
MSW1(config-if)# ip access-group SECURE_SERVER_ACCESS out
MSW1(config-if)# end
MSW1# write memory

```

### 2.3 HQ Core Switch 2 (MSW2) 설정

이중화 장비에도 동일한 정책을 적용합니다.

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname MSW2

! -- 1. 확장 ACL 생성 --
MSW2(config)# ip access-list extended SECURE_SERVER_ACCESS

! -- 2. [허용] 정책 --
MSW2(config-ext-nacl)# permit ip 192.168.10.0 0.0.0.255 host 192.168.20.12
MSW2(config-ext-nacl)# permit ip 192.168.10.0 0.0.0.255 host 192.168.20.14
MSW2(config-ext-nacl)# permit ip 192.168.40.0 0.0.0.255 host 192.168.20.12
MSW2(config-ext-nacl)# permit ip 192.168.40.0 0.0.0.255 host 192.168.20.14

! -- 3. [차단] 정책 --
MSW2(config-ext-nacl)# deny ip any host 192.168.20.12
MSW2(config-ext-nacl)# deny ip any host 192.168.20.14

! -- 4. [기본 허용] 정책 --
MSW2(config-ext-nacl)# permit ip any any
MSW2(config-ext-nacl)# exit

! -- 5. 인터페이스 적용 --
MSW2(config)# interface Vlan20
MSW2(config-if)# ip access-group SECURE_SERVER_ACCESS out
MSW2(config-if)# end
MSW2# write memory

```

---

## 3. 검증 및 테스트 (Verification)

설정 완료 후 Packet Tracer의 시뮬레이션 모드 또는 Ping 테스트를 통해 정책이 올바르게 동작하는지 확인해야 합니다.

1. **접근 성공 테스트 (Permit):**
* **PC (VLAN 10, 임원실):** `192.168.20.12` (R&D서버)로 Ping -> **성공 (Reply)**
* **PC (VLAN 40, R&D):** `192.168.20.14` (보안서버)로 Ping -> **성공 (Reply)**


2. **접근 차단 테스트 (Deny):**
* **PC (VLAN 30, 전략기획):** `192.168.20.12`로 Ping -> **실패 (Destination Unreachable)**
* **Branch PC (VLAN 150):** `192.168.20.14`로 Ping -> **실패 (Destination Unreachable)**


3. **일반 서비스 확인:**
* **PC (VLAN 30):** `192.168.20.x` (그룹웨어 또는 메일서버)로 Ping -> **성공** (마지막 줄 `permit ip any any` 에 의해)



Next Level : AWS VPC 생성 및 Site-to-Site VPN 연결 설정
