##  Inter-VLAN 라우팅 구축 

L3 스위치 1대와 L2 스위치 2대를 연동한 다중 VLAN 통신 환경을 구축하는 검증된 CLI 절차를 기술한다.

---

### 1. 네트워크 구성 및 설계

* **Core-Switch (L3, 3560 모델):** 전체 VLAN(10, 20, 30, 40)의 게이트웨이 및 라우팅 담당
* **SW-A (L2, 2960 모델):** 인사팀(V10), 회계팀(V20) 접속
* **SW-B (L2, 2960 모델):** 개발팀(V30), 기획팀(V40) 접속
* **연결:** L2 스위치들은 GigabitEthernet 0/1 포트를 통해 Core-Switch와 트렁크로 연결됨

---

### 2. 하위 L2 스위치 설정 (Packet Tracer 2960 전용)

2960 모델은 다중 VLAN 생성 명령(`vlan 10,20`)을 지원하지 않으므로, 개별적으로 생성하거나 메모장 붙여넣기를 사용해야 한다.

#### [STEP 1] SW-A 설정 (VLAN 10, 20)

```bash
SW-A> enable
SW-A# configure terminal

! 1. VLAN 개별 생성 (패킷 트레이서 호환 방식)
SW-A(config)# vlan 10
SW-A(config-vlan)# name INSA
SW-A(config-vlan)# exit
SW-A(config)# vlan 20
SW-A(config-vlan)# name ACCOUNT
SW-A(config-vlan)# exit

! 2. 액세스 포트 할당
SW-A(config)# interface range fastEthernet 0/1-10
SW-A(config-if-range)# switchport mode access
SW-A(config-if-range)# switchport access vlan 10
SW-A(config-if-range)# exit

SW-A(config)# interface range fastEthernet 0/11-20
SW-A(config-if-range)# switchport mode access
SW-A(config-if-range)# switchport access vlan 20
SW-A(config-if-range)# exit

! 3. 상위 L3 스위치 연결용 트렁크 설정
SW-A(config)# interface gigabitEthernet 0/1
SW-A(config-if)# switchport mode trunk
! (참고: 2960은 encapsulation dot1q 명령이 기본 내장되어 있어 입력 불필요)

```

#### [STEP 2] SW-B 설정 (VLAN 30, 40)

```bash
SW-B> enable
SW-B# configure terminal

! 1. VLAN 개별 생성
SW-B(config)# vlan 30
SW-B(config-vlan)# name DEV
SW-B(config-vlan)# exit
SW-B(config)# vlan 40
SW-B(config-vlan)# name PLAN
SW-B(config-vlan)# exit

! 2. 액세스 포트 할당
SW-B(config)# interface range fastEthernet 0/1-10
SW-B(config-if-range)# switchport mode access
SW-B(config-if-range)# switchport access vlan 30
SW-B(config-if-range)# exit

SW-B(config)# interface range fastEthernet 0/11-20
SW-B(config-if-range)# switchport mode access
SW-B(config-if-range)# switchport access vlan 40
SW-B(config-if-range)# exit

! 3. 트렁크 설정
SW-B(config)# interface gigabitEthernet 0/1
SW-B(config-if)# switchport mode trunk

```

---

### 3. 상위 L3 스위치 설정 (Packet Tracer 3560/3650)

L3 스위치는 패킷을 라우팅해야 하므로, **하위에 존재하는 모든 VLAN 정보(10~40)를 가지고 있어야 한다.**

#### [STEP 3] Core-Switch 설정

```bash
Core> enable
Core# configure terminal

! 1. 라우팅 기능 활성화 (가장 중요)
Core(config)# ip routing

! 2. 모든 VLAN 데이터베이스 생성 (개별 입력)
Core(config)# vlan 10
Core(config-vlan)# exit
Core(config)# vlan 20
Core(config-vlan)# exit
Core(config)# vlan 30
Core(config-vlan)# exit
Core(config)# vlan 40
Core(config-vlan)# exit

! 3. 하위 스위치 연결 포트 트렁크 설정
! (3560 이상 모델은 캡슐화 방식을 명시해야 mode trunk가 먹힘)
Core(config)# interface range gigabitEthernet 0/1-2
Core(config-if-range)# switchport trunk encapsulation dot1q
Core(config-if-range)# switchport mode trunk
Core(config-if-range)# exit

! 4. SVI(가상 인터페이스) 게이트웨이 주소 할당
Core(config)# interface vlan 10
Core(config-if)# ip address 192.168.10.1 255.255.255.0
Core(config-if)# no shutdown

Core(config)# interface vlan 20
Core(config-if)# ip address 192.168.20.1 255.255.255.0
Core(config-if)# no shutdown

Core(config)# interface vlan 30
Core(config-if)# ip address 192.168.30.1 255.255.255.0
Core(config-if)# no shutdown

Core(config)# interface vlan 40
Core(config-if)# ip address 192.168.40.1 255.255.255.0
Core(config-if)# no shutdown

```

---

### 4. 최종 검증 (PC 설정 및 Ping)

설정이 완료되면 PC에서 IP를 설정하고 통신을 확인한다.

1. **PC IP 설정:** VLAN 10에 연결된 PC에 IP `192.168.10.10`, 게이트웨이 `192.168.10.1`을 입력한다.
2. **타 VLAN 핑 테스트:** VLAN 30(개발팀) 대역인 `192.168.30.1` (게이트웨이) 또는 `192.168.30.10` (다른 PC)으로 Ping을 보낸다.
3. **성공 조건:** `Reply from ...` 메시지가 뜨면 라우팅이 정상 작동하는 것이다. (첫 번째 Ping은 ARP 과정으로 인해 실패할 수 있으니 두 번 시도한다.)

---

**Next: VTP(VLAN Trunking Protocol)를 이용한 대규모 VLAN 자동 동기화**

Manual Configuration, Interface Range, Switchport Trunk Encapsulation, SVI Setup, IP Routing
