## AWS 하이브리드 클라우드 연동을 위한 최종 표준 네트워크 설계


<img width="1536" height="791" alt="image" src="https://github.com/user-attachments/assets/b9b96f0b-2c02-462a-b2bc-47941a2e3c66" />




업로드하신 이미지(`image_5f2424.png`)는 각 장비 간의 연결 구간을 독립된 서브넷으로 완벽히 분리하면서도, 3단계 계층 구조(Core-Distribution-Access)에 맞는 일관된 IP 규칙을 적용한 최적의 설계입니다. 이 구성은 향후 AWS Site-to-Site VPN을 통해 온프레미스와 클라우드를 연결할 때 라우팅 경로를 가장 명확하게 제어할 수 있는 구조입니다.



## 1. 네트워크 주소 할당표 (최종본 반영)

내부 사용자 망은 대중적인 사설 대역인 `192.168.10.x`를 사용하고, 장비 간 연결 구간은 AWS VPC(일반적으로 `10.x.x.x` 사용)와 중복되지 않도록 `172.16.x.x` 대역을 엄격히 분리하여 할당했습니다.

| 구분 | 장비 및 인터페이스 | IP 주소 / Subnet | 연결 대상 및 목적 |
| --- | --- | --- | --- |
| **외부 연동** | Router0 Gi0/0 | **111.111.111.2/30** | ISP 1 (Primary Public Link) |
|  | Router1 Gi0/0 | **222.222.222.2/30** | ISP 2 (Secondary Public Link) |
| **백본 연결** | Router0 ↔ SW0 | 172.16.1.1 ↔ 1.2 /24 | 내부 라우팅 경로 A |
|  | Router0 ↔ SW1 | 172.16.4.1 ↔ 4.2 /24 | 내부 라우팅 경로 B |
|  | Router1 ↔ SW0 | 172.16.3.1 ↔ 3.2 /24 | 내부 라우팅 경로 C |
|  | Router1 ↔ SW1 | 172.16.2.1 ↔ 2.2 /24 | 내부 라우팅 경로 D |
| **사용자 망** | **Vlan 10 가상 GW** | **192.168.10.1/24** | **HSRP 가상 게이트웨이 IP** |
|  | SW0 Vlan 10 | 192.168.10.2/24 | SW0용 인터페이스 IP |
|  | SW1 Vlan 10 | 192.168.10.2/24 | SW1용 인터페이스 IP (이미지 기준 동일 할당) |

---

네트워크 엔지니어링 실무 및 강의 교재로 활용할 수 있도록, **L3 스위치 이중화(HSRP Priority 110)** 및 **ISP 로드밸런싱**이 적용된 전체 구성 프로세스를 정리했습니다. 각 장비의 CLI 프롬프트 변화와 필수 명령어(`no shutdown` 등)를 포함하여 한 번에 복사해서 사용할 수 있는 포맷으로 작성하였습니다.

---

네트워크 가용성과 확장성을 극대화하기 위해 VLAN 10부터 120까지(10단위) 총 12개의 가상 LAN을 구성하고, 각 VLAN에 대해 **HSRP(Hot Standby Router Protocol)** 이중화와 **OSPF** 로드밸런싱을 적용한 전체 구축 공정입니다.

---

## [STEP 1] Router0 설정 (ISP 1 서비스 및 외부 게이트웨이)

Router0은 첫 번째 공인 IP를 관리하며, 내부 모든 VLAN 대역이 인터넷이 가능하도록 NAT 처리를 수행합니다.

```bash
Router> enable
Router# configure terminal
Router0(config)# hostname Router0

! --- 외부 ISP 1 인터페이스 활성화 ---
Router0(config)# interface GigabitEthernet0/0
Router0(config-if)# description Link_to_ISP1
Router0(config-if)# ip address 111.111.111.2 255.255.255.252
Router0(config-if)# ip nat outside             ! 외부망 선언
Router0(config-if)# no shutdown                ! 포트 활성화
Router0(config-if)# exit

! --- 내부 L3 스위치(백본) 연결 ---
Router0(config)# interface GigabitEthernet0/1
Router0(config-if)# ip address 172.16.1.1 255.255.255.0
Router0(config-if)# ip nat inside              ! 내부망 선언
Router0(config-if)# no shutdown
Router0(config-if)# exit

Router0(config)# interface GigabitEthernet0/2
Router0(config-if)# ip address 172.16.4.1 255.255.255.0
Router0(config-if)# ip nat inside
Router0(config-if)# no shutdown
Router0(config-if)# exit

! --- NAT 및 기본 경로 설정 ---
Router0(config)# ip route 0.0.0.0 0.0.0.0 111.111.111.1
Router0(config)# access-list 1 permit 192.168.0.0 0.0.255.255  ! 모든 내부 대역 허용
Router0(config)# ip nat inside source list 1 interface GigabitEthernet0/0 overload

! --- OSPF 라우팅 설정 ---
Router0(config)# router ospf 1
Router0(config-router)# network 172.16.1.0 0.0.0.255 area 0
Router0(config-router)# network 172.16.4.0 0.0.0.255 area 0
Router0(config-router)# default-information originate ! 하단 스위치에 인터넷 경로 전파
Router0(config-router)# end
Router0# write memory

```

---

## [STEP 2] Router1 설정 (ISP 2 서비스 및 로드밸런싱)

Router1은 두 번째 ISP 회선을 통해 트래픽을 분산 처리하며 이중화를 완성합니다.

```bash
Router> enable
Router# configure terminal
Router1(config)# hostname Router1

! --- 외부 ISP 2 인터페이스 활성화 ---
Router1(config)# interface GigabitEthernet0/0
Router1(config-if)# description Link_to_ISP2
Router1(config-if)# ip address 222.222.222.2 255.255.255.252
Router1(config-if)# ip nat outside
Router1(config-if)# no shutdown
Router1(config-if)# exit

! --- 내부 L3 스위치(백본) 연결 ---
Router1(config)# interface GigabitEthernet0/1
Router1(config-if)# ip address 172.16.3.1 255.255.255.0
Router1(config-if)# ip nat inside
Router1(config-if)# no shutdown
Router1(config-if)# exit

Router1(config)# interface GigabitEthernet0/2
Router1(config-if)# ip address 172.16.2.1 255.255.255.0
Router1(config-if)# ip nat inside
Router1(config-if)# no shutdown
Router1(config-if)# exit

! --- NAT 및 기본 경로 설정 ---
Router1(config)# ip route 0.0.0.0 0.0.0.0 222.222.222.1
Router1(config)# access-list 1 permit 192.168.0.0 0.0.255.255
Router1(config)# ip nat inside source list 1 interface GigabitEthernet0/0 overload

! --- OSPF 라우팅 설정 ---
Router1(config)# router ospf 1
Router1(config-router)# network 172.16.3.0 0.0.0.255 area 0
Router1(config-router)# network 172.16.2.0 0.0.0.255 area 0
Router1(config-router)# default-information originate
Router1(config-router)# end
Router1# write memory

```

---

## [STEP 3] SW0 설정 (VLAN 10-120 Active / Priority 110)

SW0은 모든 VLAN에 대해 **Active 게이트웨이(Priority 110)** 역할을 수행하도록 구성합니다.

```bash
Switch> enable
Switch# configure terminal
SW0(config)# hostname SW0
SW0(config)# ip routing                      ! L3 라우팅 기능 활성화

! --- 라우터 연결 포트 (L3 포트로 변경) ---
SW0(config)# interface GigabitEthernet0/1
SW0(config-if)# no switchport                ! L2 기능을 끄고 IP 부여
SW0(config-if)# ip address 172.16.1.2 255.255.255.0
SW0(config-if)# no shutdown
SW0(config-if)# exit

SW0(config)# interface GigabitEthernet0/2
SW0(config-if)# no switchport
SW0(config-if)# ip address 172.16.3.2 255.255.255.0
SW0(config-if)# no shutdown
SW0(config-if)# exit

! --- 다중 VLAN (10~120) 및 HSRP 일괄 설정 ---
! * 10단위로 VLAN을 생성하고 각각 HSRP 우선순위 110 부여
SW0(config)# interface range vlan 10,20,30,40,50,60,70,80,90,100,110,120
! * 각 VLAN 인터페이스별 IP는 수동 할당이 필요하므로 예시로 VLAN 10 설정
SW0(config)# interface Vlan 10
SW0(config-if)# ip address 192.168.10.2 255.255.255.0
SW0(config-if)# standby 10 ip 192.168.10.1   ! 가상 게이트웨이 IP
SW0(config-if)# standby 10 priority 110      ! Active 권한 확보
SW0(config-if)# standby 10 preempt           ! 장애 복구 시 자동 회수
SW0(config-if)# no shutdown

! (나머지 VLAN 20~120번도 동일한 규칙으로 IP와 standby 그룹번호를 맞춰 설정합니다)

! --- OSPF 라우팅 설정 ---
SW0(config)# router ospf 1
SW0(config-router)# network 172.16.1.0 0.0.0.255 area 0
SW0(config-router)# network 172.16.3.0 0.0.0.255 area 0
SW0(config-router)# network 192.168.0.0 0.0.255.255 area 0
SW0(config-router)# end
SW0# write memory

```

---

## [STEP 4] SW1 설정 (VLAN 10-120 Standby / Priority 100)

SW1은 SW0 장애 시 즉시 서비스를 승계하는 대기 장비입니다.

```bash
Switch> enable
Switch# configure terminal
SW1(config)# hostname SW1
SW1(config)# ip routing

! --- 라우터 연결 포트 설정 ---
SW1(config)# interface GigabitEthernet0/1
SW1(config-if)# no switchport
SW1(config-if)# ip address 172.16.4.2 255.255.255.0
SW1(config-if)# no shutdown
SW1(config-if)# exit

SW1(config)# interface GigabitEthernet0/2
SW1(config-if)# no switchport
SW1(config-if)# ip address 172.16.2.2 255.255.255.0
SW1(config-if)# no shutdown
SW1(config-if)# exit

! --- 다중 VLAN 및 HSRP 설정 (Standby) ---
SW1(config)# interface Vlan 10
SW1(config-if)# ip address 192.168.10.3 255.255.255.0
SW1(config-if)# standby 10 ip 192.168.10.1
SW1(config-if)# standby 10 priority 100      ! 기본값 유지
SW1(config-if)# standby 10 preempt
SW1(config-if)# no shutdown

! (VLAN 20~120번도 동일한 규칙으로 Standby IP를 할당합니다)

! --- OSPF 라우팅 설정 ---
SW1(config)# router ospf 1
SW1(config-router)# network 172.16.2.0 0.0.0.255 area 0
SW1(config-router)# network 172.16.4.0 0.0.0.255 area 0
SW1(config-router)# network 192.168.0.0 0.0.255.255 area 0
SW1(config-router)# end
SW1# write memory

```

---

## 최종 구축 설계 요약

* **HSRP 이중화**: 모든 VLAN에 대해 SW0을 Active(110)로 설정하여 평상시 트래픽을 집중시키고, SW1은 Standby 상태로 대기합니다.
* **OSPF 로드밸런싱**: L3 스위치들은 두 대의 라우터로 향하는 동일 비용 경로(ECMP)를 가집니다. 이를 통해 ISP 회선 자원을 효율적으로 분산 사용합니다.
* **AWS 확장성**: 사설 대역을 `192.168.x.x`로 고정하여 AWS VPC의 기본 대역(`10.x.x.x`)과 IP가 충돌하지 않도록 설계했습니다.

**[AWS 연동 과금 유의]**
AWS Site-to-Site VPN 구축 시 시간당 약 **$0.05**의 비용이 터널마다 발생하며, 대량의 데이터 전송 시 데이터 처리 비용이 누적될 수 있습니다.

Next Level : AWS Transit Gateway를 이용한 다중 VLAN 대규모 하이브리드 연동

VLAN 10~120 생성, HSRP Priority 110, OSPF ECMP 활성화, no shutdown 완료
