# PC - L3스위치 - 라우터(루프백)

PC에서 라우터의 루프백 주소까지 통신이 가능하도록 하는 전체 설정 스크립트입니다.

---

## 1. 네트워크 구성 정보 (Updated)

| 장치 | 인터페이스 | IP 주소 | 비고 |
| --- | --- | --- | --- |
| **PC** | NIC | 192.168.10.10/24 | 게이트웨이: 192.168.10.1 |
| **3560 (L3)** | Fa0/1 (PC 방향) | 192.168.10.1/24 | Routed Port (`no switchport`) |
| **3560 (L3)** | Fa0/24 (R 방향) | **10.0.0.2/24** | 라우터와 연결되는 구간 |
| **Router** | Gi0/0 (SW 방향) | **10.0.0.1/24** | 스위치와 연결되는 구간 |
| **Router** | Loopback0 | 1.1.1.1/32 | 최종 목적지 테스트용 주소 |

---

## 2. L3 스위치(3560) 설정 파일

스위치와 라우터가 만나는 구간의 IP를 `10.0.0.2`로 설정하고, 모든 외부 트래픽을 라우터(`10.0.0.1`)로 던지도록 설정합니다.

```bash
Switch# configure terminal
Switch(config)# hostname 3560-L3
3560-L3(config)# ip routing

! --- [1] PC 연결 포트 (게이트웨이 역할) ---
3560-L3(config)# interface fastEthernet 0/1
3560-L3(config-if)# no switchport
3560-L3(config-if)# ip address 192.168.10.1 255.255.255.0
3560-L3(config-if)# no shutdown

! --- [2] 라우터 연결 포트 ---
3560-L3(config)# interface fastEthernet 0/24
3560-L3(config-if)# no switchport
3560-L3(config-if)# ip address 10.0.0.2 255.255.255.0
3560-L3(config-if)# no shutdown
3560-L3(config-if)# exit

! --- [3] 정적 경로 설정 (Default Route) ---
! 모든 모르는 네트워크(0.0.0.0)는 라우터(10.0.0.1)로 보냄
3560-L3(config)# ip route 0.0.0.0 0.0.0.0 10.0.0.1

```

---

## 3. 라우터(Router) 설정 파일

라우터의 인터페이스 IP를 `10.0.0.1`로 변경하고, 다시 스위치 하단의 PC 대역으로 돌아오는 길을 가르쳐줍니다.

```bash
Router# configure terminal
Router(config)# hostname R1

! --- [1] 스위치 연결 인터페이스 설정 ---
R1(config)# interface gigabitEthernet 0/0
R1(config-if)# ip address 10.0.0.1 255.255.255.0
R1(config-if)# no shutdown

! --- [2] 테스트용 목적지 (Loopback) ---
R1(config)# interface loopback 0
R1(config-if)# ip address 1.1.1.1 255.255.255.255

! --- [3] 돌아오는 경로 설정 (Return Route) ---
! PC 대역(192.168.10.0)으로 가려면 스위치(10.0.0.2)로 가라고 알려줌
R1(config)# ip route 192.168.10.0 255.255.255.0 10.0.0.2

```

---

## 4. 최종 통신 테스트 (PC CMD)

모든 설정이 완료된 후 PC에서 다음을 순서대로 테스트하여 경로를 검증합니다.

1. **게이트웨이 확인:** `ping 192.168.10.1`
2. **라우터 인터페이스 확인:** `ping 10.0.0.1`
3. **최종 목적지 확인:** `ping 1.1.1.1`
4. **경로 추적:** `tracert 1.1.1.1`

---

### 실전 팁: 서브넷 마스크 주의사항

"수강생들에게 **`10.0.0.1/24`**는 C클래스 마스크(`255.255.255.0`)를 사용한다는 점을 강조하세요. `10.x.x.x` 대역은 기본이 A클래스(`255.0.0.0`)이기 때문에, 마스크를 정확히 `255.255.255.0`으로 입력하지 않으면 라우팅 테이블이 꼬일 수 있습니다."

Next: `show ip route` 명령어로 스위치와 라우터의 경로 테이블 비교 분석

* 10.0.0.0/24 대역 적용
* no switchport 설정
* Default Route 설정
* Return Route (Static) 설정
* traceroute 경로 검증
